In [58]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [59]:
PATH = 'titanic/'

In [60]:
df = pd.read_csv(f'{PATH}train.csv', na_values= ['NaN', ' '])

In [61]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
df.isna().sum()/len(df)

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [63]:
newcabin01 = df.Cabin.isna()
df = df.join(newcabin01, rsuffix='01')

In [64]:
df.Sex.mode()

0    male
dtype: object

In [65]:
df.Sex.fillna(df.Sex.mode(), inplace=True)

In [66]:
df.Sex = df.Sex.astype('category')
df['Sex01'] = df.Sex.cat.codes
df.Sex.cat.categories

Sex = 0 = Female

Sex = 1 = Male

In [68]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin01,Sex01
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,True,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,False,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,True,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,False,0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,True,1

In [69]:
df.isna().sum()/len(df)

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
Cabin01        0.000000
Sex01          0.000000
dtype: float64

In [70]:
df.Embarked.mode()

0    S
dtype: object

In [71]:
df.Embarked.fillna('S', inplace=True)

In [72]:
df.drop(['Cabin','Sex'],axis=1, inplace=True)

In [73]:
df[df.Age.isna()].groupby('Survived').count()

,PassengerId,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked,Cabin01,Sex01
Survived,,,,,,,,,,,
0,125,125,125,0,125,125,125,125,125,125,125
1,52,52,52,0,52,52,52,52,52,52,52

In [74]:
df.Age.fillna(df.Age.median(), inplace = True)

In [90]:
df.Embarked = df.Embarked.astype('category')
df['Emb01'] = df.Embarked.cat.codes
df.Embarked.cat.categories

Index(['C', 'Q', 'S'], dtype='object')

In [76]:
df.SibSp.value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [77]:
df.Parch.value_counts()

0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: Parch, dtype: int64

In [91]:
df_fin = df.drop(['Name', 'Ticket', 'PassengerId', 'Embarked'], axis=1)

In [92]:
df_fin.head()

   Survived  Pclass   Age  SibSp  Parch     Fare  Cabin01  Sex01  Emb01
0         0       3  22.0      1      0   7.2500     True      1      2
1         1       1  38.0      1      0  71.2833    False      0      0
2         1       3  26.0      0      0   7.9250     True      0      2
3         1       1  35.0      1      0  53.1000    False      0      2
4         0       3  35.0      0      0   8.0500     True      1      2

In [93]:
x = df_fin.iloc[:,1:]
y = df_fin.Survived

In [94]:
from sklearn.model_selection import train_test_split

In [95]:
x_train, x_val, y_train, y_val = train_test_split(x, y)

In [96]:
from sklearn.ensemble import RandomForestClassifier

In [139]:
m = RandomForestClassifier(n_estimators=150, min_samples_leaf=5, max_features='auto')
m.fit(x_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
            max_depth=None, max_features='auto', max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=5, min_samples_split=2,
            min_weight_fraction_leaf=0.0, n_estimators=150, n_jobs=1,
            oob_score=False, random_state=None, verbose=0,
            warm_start=False)

In [140]:
print('Train score: ', m.score(x_train, y_train))
print('Test score: ', m.score(x_val, y_val))

Train score:  0.874251497005988
Test score:  0.8385650224215246

In [112]:
df_test = pd.read_csv(f'{PATH}test.csv', na_values= ['NaN', ' '])

In [126]:
df_test.head(10)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Cabin01,Sex01,Emb01
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,True,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,True,0,2
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,True,1,1
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,True,1,2
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,True,0,2
5,897,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S,True,1,2
6,898,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,True,0,1
7,899,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S,True,1,2
8,900,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C,True,0,0
9,901,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S,True,1,2

In [125]:
df_test.isna().sum()/len(df_test)

PassengerId    0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.000000
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.782297
Embarked       0.000000
Cabin01        0.000000
Sex01          0.000000
Emb01          0.000000
dtype: float64

In [115]:
newcabin01 = df_test.Cabin.isna()
df_test = df_test.join(newcabin01, rsuffix='01')

In [118]:
df_test.Age.fillna(df_test.Age.median(), inplace = True)

In [120]:
df_test.Fare.fillna(df_test.Fare.median(), inplace = True)

In [123]:
df_test.Sex = df_test.Sex.astype('category')
df_test['Sex01'] = df_test.Sex.cat.codes
df_test.Sex.cat.categories

Index(['female', 'male'], dtype='object')

In [124]:
df_test.Embarked = df_test.Embarked.astype('category')
df_test['Emb01'] = df_test.Embarked.cat.codes
df_test.Embarked.cat.categories

Index(['C', 'Q', 'S'], dtype='object')

In [128]:
df_test_fin = df_test.drop(['PassengerId','Name','Cabin','Ticket', 'Embarked','Sex'],axis=1)

In [131]:
pred = m.predict(df_test_fin)

In [132]:
pred.tofile('submit.csv', sep=',')

In [141]:
from sklearn.neural_network import MLPClassifier

In [163]:
m2 = MLPClassifier(hidden_layer_sizes=(100,3), random_state=2)
m2.fit(x_train,y_train)

MLPClassifier(activation='relu', alpha=0.0001, batch_size='auto', beta_1=0.9,
       beta_2=0.999, early_stopping=False, epsilon=1e-08,
       hidden_layer_sizes=(100, 3), learning_rate='constant',
       learning_rate_init=0.001, max_iter=200, momentum=0.9,
       nesterovs_momentum=True, power_t=0.5, random_state=2, shuffle=True,
       solver='adam', tol=0.0001, validation_fraction=0.1, verbose=False,
       warm_start=False)

In [165]:
print('Train score: ', m2.score(x_train, y_train))
print('Test score: ', m2.score(x_val, y_val))

Train score:  0.8248502994011976
Test score:  0.8116591928251121

In [166]:
pred = m2.predict(df_test_fin)

In [167]:
pred.tofile('submit2.csv', sep=',')